{
    "@context": "/api/contexts/Article",
    "@id": "/api/articles",
    "@type": "hydra:Collection",
    "hydra:member": [
        {
            "@id": "/api/articles/1",
            "@type": "Article",
            "id": 1,
            "title": "Je suis le premier article",
            "description": "Ceci est la description du premier article ceci est la description du premier article ceci est la description du premier article ceci est la description du premier article",
            "category": "General",
            "nb_like": 22,
            "nb_comment": 5,
            "nbLike": 22,
            "nbComment": 5
        },
        {
            "@id": "/api/articles/2",
            "@type": "Article",
            "id": 2,
            "title": "Comment manger des pates ?",
            "description": "Premièrement, prenez les pates avec votre couvert (en fonction du type de pate). Ensuite, ouvrez la bouche et mettez les pates récemment sélectionnées à l'intérieur de celle-ci. Retirez le couvert, machez puis avalez !",
            "category": "Food",
            "nb_like": 3,
            "nb_comment": 3,
            "nbLike": 3,
            "nbComment": 3
        },
        {
            "@id": "/api/articles/3",
            "@type": "Article",
            "id": 3,
            "title": "Anthony SAHUC se fourvoit-il ?",
            "description": "Ce bon gros Anthony Sahuc est un garcon bien miserable, bien miteux. En effet, il aime faire des louping en voiturette de golf sur les rond point. Il aime aussi ecraser froidement des mamies sur les périphéries de Paris. Blablablablablablab lablablablabla blablablablabla blablablablablablablabl ablablablablablablablab lablablablablablablabla blablablablablablablabl ablablablablablablablab lablablablablablablabla blablablablablablab lablablablabla il faut aggrandir la description donc je met des blablablablablablablablablablablabla voila c'est comme ca blablabla ma description est maintenant bien pluuuuuus longue. En conclusion anthony sahuc aka totolasecu est miteux.",
            "category": "Science",
            "nb_like": 2,
            "nb_comment": 4,
            "nbLike": 2,
            "nbComment": 4
        },
        {
            "@id": "/api/articles/4",
            "@type": "Article",
            "id": 4,
            "title": "Cet article est-il un test ?",
            "description": "La question qu'on se pose est si cet artcle est un teeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeessssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssstttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttt ou nooon ? Un texte est une série orale ou écrite de mots perçus comme constituant un ensemble cohérent, porteur de sens et utilisant les structures propres à une langue. Un texte n'a pas de longueur déterminée sauf dans le cas de poèmes à forme fixe comme le sonnet ou le haïku. Wikipédia",
            "category": "General",
            "nb_like": 0,
            "nb_comment": 1,
            "nbLike": 0,
            "nbComment": 1
        },
        {
            "@id": "/api/articles/5",
            "@type": "Article",
            "id": 5,
            "title": "Un trou noir détecté dans un amas d’étoiles",
            "description": "Des astronomes ont détecté pour la première fois un trou noir dans un très jeune amas d’étoiles en dehors de notre galaxie, grâce à une méthode promettant de nouvelles découvertes de ces objets difficiles à cerner, révèle une étude, jeudi 11 novembre. « Il y a tant de trous noirs dans l’Univers, mais nous ne les connaissons pas parce que nous ne pouvons pas les voir », a expliqué Sara Saracino, astrophysicienne à l’Institut de recherche en astrophysique de l’université de Liverpool, au Royaume-Uni. La couleur noire qu’on leur attribue ne traduit que le fait que ces astres sont, par définition, invisibles. Leur force gravitationnelle est si puissante que même la lumière ne peut s’en échapper. On peut les détecter indirectement, par le rayonnement émis à leur frontière quand ils absorbent de la matière, ou par les ondes gravitationnelles que provoque par exemple la fusion de deux trous noirs. Et sinon plus directement, lorsque la proximité du trou noir avec une étoile proche perturbe l’orbite de cette dernière. Grâce à cette dernière technique, l’équipe menée par Mme Saracino a découvert un trou noir d’une masse d’environ onze soleils, située dans l’amas d’étoiles NGC 1850 du Grand Nuage de Magellan, une galaxie proche de la Voie lactée, à environ 160 000 années-lumière. Ce « petit » trou noir déforme un peu son étoile proche, qui pèse cinq masses solaires. « C’est la première fois qu’on en détecte un avec cette technique dans un très jeune amas », en dehors de notre Voie lactée, dit la scientifique, dont l’étude paraît dans les Monthly Notices of the Royal Astronomical Society.",
            "category": "Science",
            "nb_like": 0,
            "nb_comment": 0,
            "nbLike": 0,
            "nbComment": 0
        },
        {
            "@id": "/api/articles/6",
            "@type": "Article",
            "id": 6,
            "title": "Avec son « Scorpion », Drake fait mouche",
            "description": "Les records de streaming que le rappeur Drake vient de battre ce premier week-end de juillet avec son album Scorpion, sorti le 29 juin, ne vont pas aider à tempérer l’ardeur égotique du rappeur. Avec plus de 300 millions d’écoutes en ligne en vingt-quatre heures, le Canadien de 32 ans pulvérise son précédent record établi en mars 2017 avec More Life. Depuis 2010, Drake enregistre, en effet, un disque ou une mixtape tous les ans, humant l’air du temps, surfant sur l’humeur de ses contemporains, planant dans les nuages du cloud rap pour Nothing Was the Same en 2013, vibrant au dancehall jamaïquain pour Views en 2016, pillant le grime anglais pour More Life en 2017… La première écoute de ce disque est, pour le moins, déroutante. Pour les vingt-cinq titres de ce Scorpion (son signe astrologique), aucune tendance évidente ne se dégage tant les titres de ce cinquième album studio apparaissent décousus, sans réelle cohérence les uns avec les autres. Même Michael Jackson, l’invité de marque ressuscité d’entre les morts, sur le titre Don’t Matter to Me, semble quelque peu égaré. Mais à se plonger dans les méandres de ce Scorpion, on finit par trouver ses repères : le choix des samples (de Marvin Gaye à Nas), l’universalité des sujets traités et cette voix hypnotisante rarement agressive.",
            "category": "Music",
            "nb_like": 0,
            "nb_comment": 0,
            "nbLike": 0,
            "nbComment": 0
        },
        {
            "@id": "/api/articles/7",
            "@type": "Article",
            "id": 7,
            "title": "Post Malone: son album «Stoney» est certifié double disque de platine!",
            "description": "C’est sans doute une des révélations de cette année. Post Malone continue d’empiler les récompenses.  Comme le rapporte Universal sur Twitter, son album «Stoney» vient d’être certifié double disque de platine par le RIAA, l’équivalent du SNEP (Syndicat National de l'Edition Phonographique) aux Etats-Unis.",
            "category": "Music",
            "nb_like": 1,
            "nb_comment": 2,
            "nbLike": 1,
            "nbComment": 2
        },
        {
            "@id": "/api/articles/8",
            "@type": "Article",
            "id": 8,
            "title": "Drake et The Weeknd boycottent les Grammy",
            "description": "C’est sans doute une des révélations de cette année. Post Malone continue d’empiler les récompenses.  Comme le rapporte Universal sur Twitter, son album «Stoney» vient d’être certifié double disque de platine par le RIAA, l’équivalent du SNEP (Syndicat National de l'Edition Phonographique) aux Etats-Unis. Les artistes qui manqueront à l'appel seront presque les deux plus gros vendeurs du game: Drake et The Weeknd ont en effet décidé de ne soumettre aucun morceau à l'examen de la Recording Academy, chargée de classer les morceaux et les artistes. Une institution avec laquelle Drizzy est en conflit depuis de nombreuses années. Comme beaucoup d'artistes, il ne comprend pas que certains rappeurs soient boycottés à cause de leur image (comme Lil Wayne à l'époque), ou alors que leurs morceaux soient rangés dans la catégorie rap alors que c'est de la pop, juste parce qu'ils sont noirs (comme pour certains morceaux de Drake il y a quelques années). Du coup, ni Drake, ni The Weekend n'auront soumis de chanson à l’examen des juges, même si ils apparaissent en featuring sur d'autres morceaux qui eux, ont été proposés. Rendez-vous le 5 février 2023 pour la cérémonie à Los Angeles, mais il y a fort à parier que la liste des boycott va s'allonger d'ici là! Anderson .Paak et Bruno Mars ont d'ailleurs eux aussi annoncé qu'ils allaient aussi ne pas participer à la soirée.",
            "category": "Music",
            "nb_like": 0,
            "nb_comment": 0,
            "nbLike": 0,
            "nbComment": 0
        },
        {
            "@id": "/api/articles/9",
            "@type": "Article",
            "id": 9,
            "title": "L’influence tenace des marabouts sur le sport en Afrique de l’Ouest",
            "description": "Talent, coup de chance ou magie noire ? En 1992, les Eléphants de Côte d’Ivoire remportent leur première Coupe d’Afrique des nations (CAN) au Sénégal face au Ghana après une interminable séance de tirs au but (11-10). Des membres de la fédération ivoirienne de football et René Diby, le ministre ivoirien des sports de l’époque, révéleront plus tard que la sélection avait recouru à des féticheurs, qualifiés par le ministre de « préparateurs psychologiques », originaires du village d’Akradio, à une heure d’Abidjan. La dizaine d’hommes en question aurait prédit la victoire des Ivoiriens ainsi que d’autres faits de jeu tout au long de la compétition. Mais l’histoire ne s’arrête pas là. Ces fameux féticheurs, tous originaires de la même province que le ministre des sports, se seraient ensuite fâchés : M. Diby n’aurait pas répondu à leurs requêtes, notamment financières. Un mécontentement qui aurait valu à l’équipe nationale d’échouer lors des CAN suivantes.",
            "category": "Sport",
            "nb_like": 0,
            "nb_comment": 0,
            "nbLike": 0,
            "nbComment": 0
        },
        {
            "@id": "/api/articles/10",
            "@type": "Article",
            "id": 10,
            "title": "Mort d’Elizabeth II : le sport à l’arrêt en Grande-Bretagne",
            "description": "Dès l’annonce officielle de la mort de la reine d’Angleterre, Elizabeth II, jeudi 8 septembre, le monde sportif s’est mis au diapason de toute une nation. Les organisateurs du Tour cycliste de Grande-Bretagne, qui devait s’achever dimanche sur l’île de Wight, ont ainsi décidé de le clore dès jeudi soir, au terme de la cinquième étape. Le championnat PGA de golf, qui avait lieu à Wentworth, près de Londres, a lui aussi été suspendu dès jeudi soir et il a ensuite été confirmé qu’il n’y aurait pas de match vendredi.",
            "category": "Sport",
            "nb_like": 1,
            "nb_comment": 1,
            "nbLike": 1,
            "nbComment": 1
        },
        {
            "@id": "/api/articles/11",
            "@type": "Article",
            "id": 11,
            "title": "Bruxelles s’attend à une récession de l’Union européenne cet hiver",
            "description": "Les chocs déclenchés par la guerre en Ukraine vont finir par mettre l’économie européenne à l’arrêt. Les Vingt-Sept devraient officiellement entrer en récession cet hiver. Telle est la teneur de la prévision économique d’automne délivrée à Bruxelles, vendredi 11 novembre, par la Commission européenne. « L’économie est à un tournant après un premier semestre de l’année étonnamment solide, a rappelé Paolo Gentiloni, le commissaire à l’économie. Elle a cependant perdu de son élan au troisième trimestre, et des données récentes laissent présager une contraction cet hiver. ». ",
            "category": "General",
            "nb_like": 0,
            "nb_comment": 0,
            "nbLike": 0,
            "nbComment": 0
        },
        {
            "@id": "/api/articles/12",
            "@type": "Article",
            "id": 12,
            "title": "Un appétit croissant pour la nourriture grecque",
            "description": "Feta, huile d’olive, vin, légumes bio… Les produits agricoles et alimentaires venus de Grèce s’exportent actuellement comme des petits pains, à la faveur d’une économie en transformation dans ce pays d’Europe du Sud. Celui-ci se lance maintenant à la conquête du marché français. L’édition 2022 du SIAL, le Salon International de l’Alimentation, a marqué un retour en force de la Grèce : avec non moins de 311 entreprises représentées à Villepinte, dans le nord de Paris, le pays se classe au 5e rang en termes de nombre d’exposants – devant des acteurs majeurs comme les Etats-Unis.",
            "category": "Food",
            "nb_like": 0,
            "nb_comment": 0,
            "nbLike": 0,
            "nbComment": 0
        },
        {
            "@id": "/api/articles/13",
            "@type": "Article",
            "id": 13,
            "title": "Travis Scott dévoile des extraits d’Utopia",
            "description": "Un peu plus de 4 ans après le carton Astroworld, Travis Scott prépare son retour par la grande porte. D’ailleurs, le rappeur a profité d’une prestation donnée à Vegas pour teaser plusieurs des titres qui seront présents sur son prochain album, le très attendu Utopia. Evoqué de longue date, le LP sera composé de titres incluant les participations de Future, Lil Uzi Vert, Kid Cudi ou encore Pharrell. Si ces grands noms n’accompagnaient pas Scott sur scène lors de son dernier show en date, son DJ s’est malgré tout chargé de jouer quelques secondes des titres permettant d’entendre Hendrix, Uzi et consorts.",
            "category": "Music",
            "nb_like": 0,
            "nb_comment": 0,
            "nbLike": 0,
            "nbComment": 0
        },
        {
            "@id": "/api/articles/14",
            "@type": "Article",
            "id": 14,
            "title": "Vaccination contre la COVID-19",
            "description": "En France, la COVID-19 a provoqué plus de 245 000 hospitalisations et plus de 62 000 décès sur l’année 2020. Par ailleurs, des nouveaux variants du SARS-COV-2 plus contagieux ont été identifiés sur le territoire national depuis plusieurs semaines et sont actuellement surveillés par Santé publique France en lien avec les Agences régionales de santé, , les laboratoires de biologie médicale et le Centre national de référence des infections respiratoires. Leur découverte sur le territoire national a conduit à mettre en place très rapidement des mesures renforcées pour détecter le plus vite possible les cas potentiels ou probables, casser les chaines de transmission et repérer l’émergence d’éventuelles nouvelles souches.",
            "category": "Science",
            "nb_like": 0,
            "nb_comment": 0,
            "nbLike": 0,
            "nbComment": 0
        },
        {
            "@id": "/api/articles/23",
            "@type": "Article",
            "id": 23,
            "title": "BurgerKing",
            "description": "It's crazy my friend !!!🐔",
            "category": "Food",
            "nb_like": 0,
            "nb_comment": 0,
            "nbLike": 0,
            "nbComment": 0
        },
        {
            "@id": "/api/articles/24",
            "@type": "Article",
            "id": 24,
            "title": "alexi vas faire le truc entrer c'est exceptionnel !!!",
            "description": "Alexi se doit de faire le truc entrer de puis maintenant plus de 2h et bien évidement il ne l'a toujours pas fait. Ce faisant Lucas va lui mettre une fessé car c'est bien trop relou de plus celui-ci le demande depuis plusieurs jours il a donc tous les droits sur son esclave personnel. ça va partir en BDSM total ce soir mon gars sur.",
            "category": "Science",
            "nb_like": 0,
            "nb_comment": 0,
            "nbLike": 0,
            "nbComment": 0
        },
        {
            "@id": "/api/articles/25",
            "@type": "Article",
            "id": 25,
            "title": "alexi vas faire le truc entrer c'est exceptionnel !!!",
            "description": "Alexi se doit de faire le truc entrer de puis maintenant plus de 2h et bien évidement il ne l'a toujours pas fait. Ce faisant Lucas va lui mettre une fessé car c'est bien trop relou de plus celui-ci le demande depuis plusieurs jours il a donc tous les droits sur son esclave personnel. ça va partir en BDSM total ce soir mon gars sur.",
            "category": "Science",
            "nb_like": 0,
            "nb_comment": 0,
            "nbLike": 0,
            "nbComment": 0
        },
        {
            "@id": "/api/articles/26",
            "@type": "Article",
            "id": 26,
            "title": "J'ai rêvé de web toute la nuit ",
            "description": "Worst night ever !!!",
            "category": "Science",
            "nb_like": 0,
            "nb_comment": 0,
            "nbLike": 0,
            "nbComment": 0
        },
        {
            "@id": "/api/articles/27",
            "@type": "Article",
            "id": 27,
            "title": "test6",
            "description": "test6",
            "category": "General",
            "nb_like": 0,
            "nb_comment": 0,
            "nbLike": 0,
            "nbComment": 0
        },
        {
            "@id": "/api/articles/28",
            "@type": "Article",
            "id": 28,
            "title": "Pourquoi ya t-il un \"G\" à Gmail ?",
            "description": "C'est une question très intéressante. Heureusement les étudiant de Harvard ont été la pour y répondre. Avec l'aide de savants scientifiques il semblerait que le \"G\" de Gmail serait une référence à l'entreprise Google qui possèderait la messagerie 🤯",
            "category": "Science",
            "nb_like": 1,
            "nb_comment": 0,
            "nbLike": 1,
            "nbComment": 0
        },
        {
            "@id": "/api/articles/29",
            "@type": "Article",
            "id": 29,
            "title": "Anthony SAHUC fourvoit-il sa daronne ?",
            "description": "Car il aime trop aboyer pour des femmes matures",
            "category": "General",
            "nb_like": 0,
            "nb_comment": 1,
            "nbLike": 0,
            "nbComment": 1
        }
    ],
    "hydra:totalItems": 21
}